Revit 2027 API
WorksetKindFilter(WorksetKind, Boolean) Constructor
 Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetKindFilter(
	WorksetKind worksetKind,
	bool inverted
)
Public Sub New (
	worksetKind As WorksetKind,
	inverted As Boolean
)
public:
WorksetKindFilter(
	WorksetKind worksetKind,
	bool inverted
)
new :
        worksetKind : WorksetKind *
        inverted : bool -> WorksetKindFilter
Parameters
worksetKind WorksetKind
 The WorksetKind to match.
inverted Boolean
 True if the filter should match all worksets which are not of the given WorksetKind.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WorksetKindFilter Class
WorksetKindFilter Overload
Autodesk.Revit.DB Namespace